package net.neurolines.genai.util;

public enum Section2Enum {

    GHS010101("폭발성 물질", "불안정한 폭발성 물질"),
    GHS010102 ("폭발성 물질", "등급 1.1"),
    GHS010103 ("폭발성 물질", "등급 1.2"),
    GHS010104 ("폭발성 물질", "등급 1.3"),
    GHS010105 ("폭발성 물질", "등급 1.4"),
    GHS010106 ("폭발성 물질", "등급 1.5"),
    GHS010107 ("폭발성 물질", "등급 1.6"),
    GHS010201 ("인화성 가스", "구분 1"),
    GHS010202 ("인화성 가스", "구분 2"),
    GHS010205 ("인화성 가스", "자연발화성가스"),
    GHS010301 ("인화성 액체", "구분 1"),
    GHS010302 ("인화성 액체", "구분 2"),
    GHS010303 ("인화성 액체", "구분 3"),
    GHS010304 ("인화성 액체", "구분 4"),
    GHS010401 ("인화성 고체", "구분 1"),
    GHS010402 ("인화성 고체", "구분 2"),
    GHS010501 ("에어로졸", "구분 1"),
    GHS010502 ("에어로졸", "구분 2"),
    GHS010503 ("에어로졸", "구분 3"),
    GHS010601 ("물반응성 물질 및 혼합물", "구분 1"),
    GHS010602 ("물반응성 물질 및 혼합물", "구분 2"),
    GHS010603 ("물반응성 물질 및 혼합물", "구분 3"),
    GHS010701 ("산화성 가스", "구분 1"),
    GHS010801 ("산화성 액체", "구분 1"),
    GHS010802 ("산화성 액체", "구분 2"),
    GHS010803 ("산화성 액체", "구분 3"),
    GHS010901 ("산화성 고체", "구분 1"),
    GHS010902 ("산화성 고체", "구분 2"),
    GHS010903 ("산화성 고체", "구분 3"),
    GHS011001 ("고압가스", "압축가스"),
    GHS011002 ("고압가스", "액화가스"),
    GHS011003 ("고압가스", "냉동액화가스"),
    GHS011004 ("고압가스", "용해가스"),
    GHS011005 ("고압가스", "고압액화가스"),
    GHS011006 ("고압가스", "저압액화가스"),
    GHS011101 ("자기반응성 물질 및 혼합물", "형식A"),
    GHS011102 ("자기반응성 물질 및 혼합물", "형식B"),
    GHS011103 ("자기반응성 물질 및 혼합물", "형식C"),
    GHS011104 ("자기반응성 물질 및 혼합물", "형식D"),
    GHS011105 ("자기반응성 물질 및 혼합물", "형식E"),
    GHS011106 ("자기반응성 물질 및 혼합물", "형식F"),
    GHS011107 ("자기반응성 물질 및 혼합물", "형식G"),
    GHS011201 ("자연발화성 액체", "구분 1"),
    GHS011301 ("자연발화성 고체", "구분 1"),
    GHS011401 ("자기발열성 물질 및 혼합물", "구분 1"),
    GHS011402 ("자기발열성 물질 및 혼합물", "구분 2"),
    GHS011501 ("유기과산화물", "형식A"),
    GHS011502 ("유기과산화물", "형식B"),
    GHS011503 ("유기과산화물", "형식C"),
    GHS011504 ("유기과산화물", "형식D"),
    GHS011505 ("유기과산화물", "형식E"),
    GHS011506 ("유기과산화물", "형식F"),
    GHS011507 ("유기과산화물", "형식G"),
    GHS011601 ("금속부식성 물질", "구분 1"),
    GHS020101 ("급성독성(경구)", "구분 1"),
    GHS020102 ("급성독성(경구)", "구분 2"),
    GHS020103 ("급성독성(경구)", "구분 3"),
    GHS020104 ("급성독성(경구)", "구분 4"),
    GHS020105 ("급성독성(경구)", "구분 5"),
    GHS020201 ("급성독성(경피)", "구분 1"),
    GHS020202 ("급성독성(경피)", "구분 2"),
    GHS020203 ("급성독성(경피)", "구분 3"),
    GHS020204 ("급성독성(경피)", "구분 4"),
    GHS020205 ("급성독성(경피)", "구분 5"),
    GHS020301 ("급성독성(흡입:가스)", "구분 1"),
    GHS020302 ("급성독성(흡입:가스)", "구분 2"),
    GHS020303 ("급성독성(흡입:가스)", "구분 3"),
    GHS020304 ("급성독성(흡입:가스)", "구분 4"),
    GHS020305 ("급성독성(흡입:가스)", "구분 5"),
    GHS020401 ("급성독성(흡입:증기)", "구분 1"),
    GHS020402 ("급성독성(흡입:증기)", "구분 2"),
    GHS020403 ("급성독성(흡입:증기)", "구분 3"),
    GHS020404 ("급성독성(흡입:증기)", "구분 4"),
    GHS020405 ("급성독성(흡입:증기)", "구분 5"),
    GHS020501 ("급성독성(흡입:분진/미스트)", "구분 1"),
    GHS020502 ("급성독성(흡입:분진/미스트)", "구분 2"),
    GHS020503 ("급성독성(흡입:분진/미스트)", "구분 3"),
    GHS020504 ("급성독성(흡입:분진/미스트)", "구분 4"),
    GHS020505 ("급성독성(흡입:분진/미스트)", "구분 5"),
    GHS020601 ("피부 부식성", "구분 1"),
    GHS020602 ("피부 자극성", "구분 2"),
    GHS020604 ("피부 부식성", "구분 1A"),
    GHS020605 ("피부 부식성", "구분 1B"),
    GHS020606 ("피부 부식성", "구분 1C"),
    GHS020701 ("심한 눈 손상성", "구분 1"),
    GHS020703 ("눈 자극성", "구분 2A"),
    GHS020704 ("눈 자극성", "구분 2B"),
    GHS020702 ("눈 자극성", "구분 2"),
    GHS020802 ("호흡기 과민성", "구분 1A"),
    GHS020803 ("호흡기 과민성", "구분 1B"),
    GHS020801 ("호흡기 과민성", "구분 1"),
    GHS020902 ("피부 과민성", "구분 1A"),
    GHS020903 ("피부 과민성", "구분 1B"),
    GHS020901 ("피부 과민성", "구분 1"),
    GHS021001 ("발암성", "구분 1A"),
    GHS021002 ("발암성", "구분 1B"),
    GHS021003 ("발암성", "구분 2"),
    GHS021004 ("발암성", "구분 1"),
    GHS021101 ("생식세포 변이원성", "구분 1A"),
    GHS021102 ("생식세포 변이원성", "구분 1B"),
    GHS021103 ("생식세포 변이원성", "구분 2"),
    GHS021104 ("생식세포 변이원성", "구분 1"),
    GHS021201 ("생식독성", "구분 1A"),
    GHS021202 ("생식독성", "구분 1B"),
    GHS021203 ("생식독성", "구분 2"),
    GHS021204 ("생식독성", "수유독성"),
    GHS021205 ("생식독성", "구분 1"),
    GHS021301 ("특정표적장기·전신 독성(1회 노출)", "구분 1"),
    GHS021302 ("특정표적장기·전신 독성(1회 노출)", "구분 2"),
    GHS021303 ("특정표적장기·전신 독성(1회 노출)", "구분 3(호흡기 자극)"),
    GHS021304 ("특정표적장기·전신 독성(1회 노출)", "구분 3(마취 영향)"),
    GHS021401 ("특정표적장기·전신 독성(반복 노출)", "구분 1"),
    GHS021402 ("특정표적장기·전신 독성(반복 노출)", "구분 2"),
    GHS021501 ("흡인 유해성", "구분 1"),
    GHS021502 ("흡인 유해성", "구분 2"),
    GHS030101 ("급성 수생 환경유해성", "구분 1"),
    GHS030201 ("만성 수생 환경유해성", "구분 1"),
    GHS030202 ("만성 수생 환경유해성", "구분 2"),
    GHS030203 ("만성 수생 환경유해성", "구분 3"),
    GHS030204 ("만성 수생 환경유해성", "구분 4"),
    GHS030301 ("오존층 유해성", "구분 1"),
    GHS999999 ("해당없음", ""),
    ;

    private String divName;

    private String classResultName;

    private Section2Enum(String divName, String classResultName)
    {
        this.divName = divName;
        this.classResultName = classResultName;
    }

    public String getDivName()
    {
        return divName;
    }

    public String getClassResultName()
    {
        return classResultName;
    }

    public String getTotalClear()
    {
        return UtilClass.makeClearWord(divName) + classResultName.replaceAll("구분|형식|등급", "").trim();
    }

    public String getTotal()
    {
        return UtilClass.makeClearWord(divName) + UtilClass.makeClearWord(classResultName);
    }

    public String getName()
    {
        return divName + " " + classResultName;
    }
}
